<center> <span style="color:red">Name:Quratulain<br>
Email:QuratulainAIML@hotmail.com<br>
Github:QuratulainAIML<br>
Title:Practice2byq</span></center>

In [3]:
#Loading libraries
%pip install pandas

Requirement already satisfied: pandas in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\qurat\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\qurat\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
# import libraries
import pandas as pd

In [11]:
#loading dataset
pd.read_csv("data.csv")
df=pd.read_csv("data.csv")
print("Students dataset")
df

Students dataset

             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
9        Abdullah     Teacher      M   55.0        NaN
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [12]:
#install excel library
%pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (from openpyxl) (2.0.0)
Note: you may need to restart the kernel to use updated packages.

In [17]:
# print excel file
print('Preview the dataset using print function')
pd.read_excel('data.xlsx')
df= pd.read_excel('data.xlsx')
print(df)

Preview the dataset using print function
             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
9        Abdullah     Teacher      M   55.0        NaN
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [22]:
# display first 5 rows
df.head()

            Name Designation Gender   Age     Salary
0        Mukhtar   Professor      M  37.0   115000.0
1          Azziz     Teacher      M  30.0    35000.0
2         Mohsin    Engineer      M  29.0    50000.0
3  Naveed Fatima     Analyst      F  30.0    70000.0
4          Babar    Engineer      F  25.0  1500000.0

In [23]:
# display top 10 rows
df.head(10)

            Name Designation Gender   Age     Salary
0        Mukhtar   Professor      M  37.0   115000.0
1          Azziz     Teacher      M  30.0    35000.0
2         Mohsin    Engineer      M  29.0    50000.0
3  Naveed Fatima     Analyst      F  30.0    70000.0
4          Babar    Engineer      F  25.0  1500000.0
5           Aqsa   Scientist      F  22.0        NaN
6          Rafia     Analyst      F  29.0    20000.0
7          Samra   Scientist      F  26.0   115000.0
8           Eman    Engineer      F  28.0    35000.0
9       Abdullah     Teacher      M  55.0        NaN

In [ ]:
#display first 3 rows
df.head(3)

      Name Designation Gender   Age    Salary
0  Mukhtar   Professor      M  37.0  115000.0
1    Azziz     Teacher      M  30.0   35000.0
2   Mohsin    Engineer      M  29.0   50000.0

In [26]:
#display 1 row
df.head(1)

      Name Designation Gender   Age    Salary
0  Mukhtar   Professor      M  37.0  115000.0

In [27]:
# display bottom rows
df.tail()

      Name Designation Gender    Age    Salary
12   Ahsan     trainer      M  156.0  110000.0
13   Wajid     teacher      M   67.0    2000.0
14   Naeem     trainer      M   80.0   16000.0
15  Qaisar   professor      M   20.0  170000.0
16   Wajid    Engineer      M   85.0  190000.0

In [32]:
#display last one value
df.tail(1)

     Name Designation Gender   Age    Salary
16  Wajid    Engineer      M  85.0  190000.0

In [31]:
#display mid rows
df.loc[8:9]

       Name Designation Gender   Age   Salary
8      Eman    Engineer      F  28.0  35000.0
9  Abdullah     Teacher      M  55.0      NaN

In [34]:
#summary of data
df.describe()

             Age        Salary
count   16.00000  1.500000e+01
mean    48.68750  1.725333e+05
std     35.55975  3.713435e+05
min     20.00000  2.000000e+03
25%     27.50000  3.500000e+04
50%     30.00000  7.000000e+04
75%     61.75000  1.150000e+05
max    156.00000  1.500000e+06

In [ ]:
# display rows and columns
df.shape

(17, 5)

In [ ]:
#display value of column designation
df['Designation']

0     Professor
1       Teacher
2      Engineer
3       Analyst
4      Engineer
5     Scientist
6       Analyst
7     Scientist
8      Engineer
9       Teacher
10    professor
11     engineer
12      trainer
13      teacher
14      trainer
15    professor
16     Engineer
Name: Designation, dtype: object

In [ ]:
#display value of index 1
df.loc[1]

Name             Azziz
Designation    Teacher
Gender               M
Age               30.0
Salary         35000.0
Name: 1, dtype: object

In [48]:
#select two columns
sc = df[['Name' , 'Designation']]
sc

             Name Designation
0         Mukhtar   Professor
1           Azziz     Teacher
2          Mohsin    Engineer
3   Naveed Fatima     Analyst
4           Babar    Engineer
5            Aqsa   Scientist
6           Rafia     Analyst
7           Samra   Scientist
8            Eman    Engineer
9        Abdullah     Teacher
10          Mosib   professor
11          Ahmed    engineer
12          Ahsan     trainer
13          Wajid     teacher
14          Naeem     trainer
15         Qaisar   professor
16          Wajid    Engineer

In [51]:
#selecting three columns
print("Selecting three columns from dataset")
sc=df[['Name','Age','Designation']]
sc

Selecting three columns from dataset

             Name    Age Designation
0         Mukhtar   37.0   Professor
1           Azziz   30.0     Teacher
2          Mohsin   29.0    Engineer
3   Naveed Fatima   30.0     Analyst
4           Babar   25.0    Engineer
5            Aqsa   22.0   Scientist
6           Rafia   29.0     Analyst
7           Samra   26.0   Scientist
8            Eman   28.0    Engineer
9        Abdullah   55.0     Teacher
10          Mosib   60.0   professor
11          Ahmed    NaN    engineer
12          Ahsan  156.0     trainer
13          Wajid   67.0     teacher
14          Naeem   80.0     trainer
15         Qaisar   20.0   professor
16          Wajid   85.0    Engineer

In [106]:
# display name and salary column of row 4,5
df1=df[['Name','Salary']]
df1.loc[4:5]

    Name     Salary
4  Babar  1500000.0
5   Aqsa        NaN

In [105]:
# display name and salary column of row 4,5
df1=df.loc[4:5,['Name','Salary']]
print("Selected rows and columns")
df1

Selected rows and columns

    Name     Salary
4  Babar  1500000.0
5   Aqsa        NaN

In [ ]:
# check nullvalue
qurat=df
qurat.isnull().sum()

Name           0
Designation    0
Gender         0
Age            1
Salary         2
dtype: int64

In [ ]:
# drop index 9
nd=df.drop(9)
print("Data after dropping index 9")
print(nd)

Data after dropping index 9
             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [ ]:
# drop index 5and 9
nd=df.drop(index=[5,9])
print("Data after dropping index 5-9")
print(nd)

Data after dropping index 5-9
             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M   30.0    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [ ]:
# drop index from 5 to 9
nd=df.drop(index=[5,6,7,8,9])
print("Data after dropping index 5-9")
print(nd)

Data after dropping index 5-9
             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [ ]:
#drop column gender
nc=df.drop(columns='Gender')
print("Data after dropping column gender")
print(nc)

Data after dropping column gender
             Name Designation    Age     Salary
0         Mukhtar   Professor   37.0   115000.0
1           Azziz     Teacher   30.0    35000.0
2          Mohsin    Engineer   29.0    50000.0
3   Naveed Fatima     Analyst   30.0    70000.0
4           Babar    Engineer   25.0  1500000.0
5            Aqsa   Scientist   22.0        NaN
6           Rafia     Analyst   29.0    20000.0
7           Samra   Scientist   26.0   115000.0
8            Eman    Engineer   28.0    35000.0
9        Abdullah     Teacher   55.0        NaN
10          Mosib   professor   60.0    70000.0
11          Ahmed    engineer    NaN    90000.0
12          Ahsan     trainer  156.0   110000.0
13          Wajid     teacher   67.0     2000.0
14          Naeem     trainer   80.0    16000.0
15         Qaisar   professor   20.0   170000.0
16          Wajid    Engineer   85.0   190000.0

In [ ]:
#drop two columns
nc=df.drop(columns=['Gender','Age'])
print("Data after dropping column gender and age")
print(nc)

Data after dropping column gender and age
             Name Designation     Salary
0         Mukhtar   Professor   115000.0
1           Azziz     Teacher    35000.0
2          Mohsin    Engineer    50000.0
3   Naveed Fatima     Analyst    70000.0
4           Babar    Engineer  1500000.0
5            Aqsa   Scientist        NaN
6           Rafia     Analyst    20000.0
7           Samra   Scientist   115000.0
8            Eman    Engineer    35000.0
9        Abdullah     Teacher        NaN
10          Mosib   professor    70000.0
11          Ahmed    engineer    90000.0
12          Ahsan     trainer   110000.0
13          Wajid     teacher     2000.0
14          Naeem     trainer    16000.0
15         Qaisar   professor   170000.0
16          Wajid    Engineer   190000.0

In [94]:
# deal missing value
df.isnull().sum()

Name           0
Designation    0
Gender         0
Age            1
Salary         2
dtype: int64

In [96]:
# deal missing value
df['Age'].isnull().sum()

np.int64(1)

In [103]:
#replace null values
df['Age']=df['Age'].fillna(df['Age'].median())
df['Age']

0      37.0
1      30.0
2      29.0
3      30.0
4      25.0
5      22.0
6      29.0
7      26.0
8      28.0
9      55.0
10     60.0
11     30.0
12    156.0
13     67.0
14     80.0
15     20.0
16     85.0
Name: Age, dtype: float64